## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_custom_domain.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "mta-sts" {
      + cdn_frontdoor_profile_id = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/afd-mta-sts"
      + dns_zone_id              = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-dnszones/providers/Microsoft.Network/dnsZones/tfttest.matthewjwhite.co.uk"
      + expiration_date          = (known after apply)
      + host_name                = "mta-sts.tfttest.matthewjwhite.co.uk"
      + id                       = (known after apply)
      + name                     = "cdnmwtftestmtasts"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_frontdoor_custom_domain_association.mta-sts will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "mta-sts" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = [
          + "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-whitefam-cdnprofiles/providers/Microsoft.Cdn/profiles/afd-mta-sts/afdEndpoints/cdnmwtftestmtasts/routes/cdnmwtftestmtasts",
        ]
      + id                             = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_dns_txt_record.dnsauth will be created
  + resource "azurerm_dns_txt_record" "dnsauth" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.mta-sts"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest.matthewjwhite.co.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.tftest-mjw-mtasts.azurerm_storage_account.mta-sts will be updated in-place
  ~ resource "azurerm_storage_account" "mta-sts" {
        id                                 = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/RG-WhiteFam-UKS/providers/Microsoft.Storage/storageAccounts/stmwtftestmtasts"
        name                               = "stmwtftestmtasts"
        tags                               = {
            "managed" = "as-code"
            "source"  = "terraform"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = (sensitive value)
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>